tunr_app_api/app/controllers/joins_controller.rb

SELECT "joins".* FROM "joins"
---
  def index
    @joins = Join.all

SELECT "joins".* FROM "joins" WHERE "joins"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_join
      @join = Join.find(params[:id])