tunr_app_api/app/controllers/relates_controller.rb

SELECT "relates".* FROM "relates"
---
  def index
    @relates = Relate.all