tunr_app_api/app/controllers/songs_controller.rb

INSERT INTO "songs" ("title", "artist", "time", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Catching Fireflies"], ["artist", "The Revivalists"], ["time", 313], ["created_at", "2020-08-06 17:42:27.910074"], ["updated_at", "2020-08-06 17:42:27.910074"]]
SELECT "playlists".* FROM "playlists" WHERE "playlists"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def create
    song = Playlist.find(params[:playlist_id]).songs.create(song_params)

UPDATE "songs" SET "title" = $1, "updated_at" = $2 WHERE "songs"."id" = $3  [["title", "Takin' My Time"], ["updated_at", "2020-08-06 19:14:19.005032"], ["id", 8]]
---
  def update
    if @song.update(song_params)